# Taps
tap "mackerelio/mackerel-agent"
tap "ynqa/tap"

# Homebrew packages
brew "actionlint"
brew "ansible"
brew "awscli"
brew "bat"
brew "cask"
brew "circleci"
brew "docker-compose"
brew "doctl"
brew "gh"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "helm"
brew "htop"
brew "iproute2mac"
brew "jq"
brew "kubernetes-cli"
brew "mkcert"
brew "mkr"
brew "nodebrew"
brew "openssl"
brew "peco"
brew "pyenv"
brew "python"
brew "reattach-to-user-namespace"
brew "telnet"
brew "tfenv"
brew "tmux"
brew "tree"
brew "trivy"
brew "watch"
brew "wget"
brew "yarn"
brew "ynqa/tap/jnv"
brew "zsh"

# Cask packages (GUI applications)
cask "1password"
cask "1password-cli"
cask "antigravity"
cask "bitbar"
cask "chatwork"
cask "ghostty"
cask "google-japanese-ime"
cask "kiro"
cask "macdown"
cask "macvim-app"
cask "messenger"
cask "raycast"
cask "skitch"
cask "slack"
cask "visual-studio-code"
